Revit 2027 API
BendingDetailCustomFieldProperties.RadialDimensionTypeId Property
 Identifies the Id of the radial dimension type which is used to show dimensions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId RadialDimensionTypeId { get; set; }
Public Property RadialDimensionTypeId As ElementId
	Get
	Set
public:
property ElementId^ RadialDimensionTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member RadialDimensionTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The radialDimensionTypeId should be an id of a radial dimension type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace